## Pandas

### Pandas fo Data Analysis

In [2]:
# First import pandas
import pandas as pd

In [3]:
# Creating a series
new_s = pd.Series([10, 20, 30, 40])

In [4]:
new_s

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
# Another series with a set index instead of the defaukt
put_index = pd.Series([50, 60, 70, 80], index = ['a', 'b', 'c', 'd'])

In [6]:
put_index

a    50
b    60
c    70
d    80
dtype: int64

In [7]:
# Pandas Data Frame
# Data frame has two dimensions that is  it has rows and columns
# Example a data frame with three lists

colors = ["red", "green", "black", "yellow"]
degrees = [100, 120, 60, 75]
numbers = [24, 26, 28, 30]

# Create a dataframe
new_df = pd.DataFrame({"colors": colors, "degrees":degrees, "numbers": numbers},
                       columns =["colors", "degrees", "numbers"],
                              index = range(1, 5))

In [8]:
new_df

   colors  degrees  numbers
1     red      100       24
2   green      120       26
3   black       60       28
4  yellow       75       30

In [9]:
# Reading the csv files using pandas
df_csv = pd.read_csv('sample10.csv', low_memory=False) # Args: fileName, lowMemory

In [10]:
df_csv

   No   Cars  numbers  year  price
0   1   Car1      123  2005   5000
1   2   Car2      456  2006   6000
2   3   Car3      789  2007   7000
3   4   Car4     1011  2008   8000
4   5   Car5     1213  2009   9000
5   6   Car6     1415  2010  10000
6   7   Car7     1617  2011  11000
7   8   Car8     1819  2012  12000
8   9   Car9     2011  2013  13000
9  10  Car10     2356  2014  14000

In [11]:
# To display a given number of rows we can use the head funtion
df_csv.head(6)

   No  Cars  numbers  year  price
0   1  Car1      123  2005   5000
1   2  Car2      456  2006   6000
2   3  Car3      789  2007   7000
3   4  Car4     1011  2008   8000
4   5  Car5     1213  2009   9000
5   6  Car6     1415  2010  10000

In [12]:
# By default the head function displays the first 5 rows
df_csv.head()

   No  Cars  numbers  year  price
0   1  Car1      123  2005   5000
1   2  Car2      456  2006   6000
2   3  Car3      789  2007   7000
3   4  Car4     1011  2008   8000
4   5  Car5     1213  2009   9000

In [13]:
# Displaying contents from an html file
new_url =  "https://en.wikipedia.org/wiki/Academy_Awards"

In [14]:
new_html = pd.read_html(new_url, header=0, index_col=0)[3]

In [15]:
new_html

,Unnamed: 1,Unnamed: 2
Award,Best Actor,Best Actress
Winner,Cillian Murphy (Oppenheimer),Emma Stone (Poor Things)
NaN,NaN,NaN
Award,Best Supporting Actor,Best Supporting Actress
Winner,Robert Downey Jr. (Oppenheimer),Da'Vine Joy Randolph (The Holdovers)
NaN,NaN,NaN
Award,Best Director,Best Original Screenplay
Winner,Christopher Nolan (Oppenheimer),Justine Triet and Arthur Harari (Anatomy of a ...

In [17]:
# Some operations available for the pandas library
df_csv.shape

(10, 5)

In [18]:
df_csv.info() # Shows col information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   No       10 non-null     int64
 1   Cars     10 non-null     object
 2   numbers  10 non-null     int64
 3   year     10 non-null     int64
 4   price    10 non-null     int64
dtypes: int64(4), object(1)
memory usage: 532.0+ bytes

In [19]:
df_csv.describe() # Shows descriptive statistics

             No      numbers        year         price
count  10.00000    10.000000    10.00000     10.000000
mean    5.50000  1281.000000  2009.50000   9500.000000
std     3.02765   703.167279     3.02765   3027.650354
min     1.00000   123.000000  2005.00000   5000.000000
25%     3.25000   844.500000  2007.25000   7250.000000
50%     5.50000  1314.000000  2009.50000   9500.000000
75%     7.75000  1768.500000  2011.75000  11750.000000
max    10.00000  2356.000000  2014.00000  14000.000000

In [22]:
 # Displaying the max values in a column
df_csv.loc[df_csv["price"].argmax()][["Cars", "price"]]

Cars     Car10
price    14000
Name: 9, dtype: object

In [23]:
# displaying the minimum values in a column
df_csv.loc[df_csv["price"].argmin()][["Cars", "price"]]

Cars     Car1
price    5000
Name: 0, dtype: object

In [ ]:
# Reading and analysing